using tyuiu.cources.programming.interfaces.Sprint2;
namespace Tyuiu.SlokvaGA.Sprint2.Task2.V25.Lib
{
    public class DataService : ISprint2Task2V25
    {
        public bool CheckDotInShadedArea(int x, int y)
        {
            return
        // Прямоугольник 3x4 в левом верхнем углу
        (x >= 3 && x <= 5 && y >= 3 && y <= 4) ||
        // Прямоугольник 9x4 справа
        (x >= 9 && x <= 12 && y >= 3 && y <= 4) ||
        // Маленький прямоугольник 1x2 слева
        (x >= 1 && x <= 2 && y >= 5 && y <= 6) ||
        // Большой центральный прямоугольник
        (x >= 3 && x <= 12 && y >= 5 && y <= 7) ||
        // Горизонтальная линия y=11 от x=3 до x=5
        (x >= 3 && x <= 5 && y == 11) ||
        // Вертикальный блок 6x11
        (x >= 6 && x <= 7 && y >= 8 && y <= 11) ||
        // Отдельная точка (7,12)
        (x == 7 && y == 12) ||
        // Горизонтальная линия y=8 от x=8 до x=9
        (x >= 8 && x <= 9 && y == 8) ||
        // Отдельная точка (10,12)
        (x == 10 && y == 12) ||
        // Прямоугольник 10x11
        (x >= 10 && x <= 11 && y >= 8 && y <= 11) ||
        // Точка (12,8)
        (x == 12 && y == 8) ||
        // Вертикальная линия x=13 от y=6 до y=8
        (x == 13 && y >= 6 && y <= 8);
        }
    }
}
